{"/about/":{"data":{"about-my-app#About My App":"About My AppMy App is a powerful tool designed to help users accomplish their goals efficiently and effectively. This documentation site serves as a comprehensive guide to understanding and using My App.","contact#Contact":"For any inquiries, please reach out to us:\nGitHub: github.com/yourusername/your-repo Email: your.email@example.com ","our-mission#Our Mission":"To provide users with a seamless and intuitive experience while helping them achieve their objectives."},"title":"About"},"/blog/":{"data":{"blog#Blog":"BlogStay up to date with the latest AutoCRUD news, updates, and technical articles.","latest-posts#Latest Posts":"Check back soon for our first blog post!"},"title":"Blog"},"/docs/":{"data":{"features#Features":" Feature 1 Feature 2 Feature 3 ","need-help#Need Help?":"If you need help with My App, feel free to:\nCheck our FAQ section Report an issue Contact support ","quick-start#Quick Start":"Get started with My App in minutes:\nInstallation Guide Basic Usage Configuration ","welcome-to-my-app-documentation#Welcome to My App Documentation":"Welcome to My App DocumentationWelcome to the documentation for My App. Here you’ll find comprehensive guides and documentation to help you start working with My App as quickly as possible."},"title":"Documentation"},"/docs/getting-started/":{"data":{"installation-steps#Installation Steps":" Step 1\n# Command for step 1 Step 2\n# Command for step 2 Step 3\n# Command for step 3 ","installing-my-app#Installing My App":"Installing My AppThis guide will walk you through the process of installing My App on your system.","next-steps#Next Steps":" Basic Usage Configuration Troubleshooting ","prerequisites#Prerequisites":"Before installing My App, ensure you have the following:\nRequirement 1 Requirement 2 Requirement 3 ","verification#Verification":"To verify that My App is installed correctly, run:\n# Verification command "},"title":"Getting Started"},"/docs/welcome/":{"data":{"":"","features#Features":"","how-can-i-contribute-to-nocodbs-development-#How can I contribute to NocoDB\u0026rsquo;s development ?":"NocoDB is a no-code database platform that allows teams to collaborate and build applications with ease of a familiar and intuitive spreadsheet interface. This allows even non-developers or business users to become software creators.\nNocoDB works by connecting to any relational database and transforming them into a smart spreadsheet interface! This allows you to build no-code applications collaboratively with teams. NocoDB currently works with MySQL, PostgreSQL \u0026 SQLite (only in Open Source) databases.\nAlso, NocoDB’s app store allows you to build business workflows on views with combination of Slack, Microsoft Teams, Discord, Twilio, Whatsapp, Email \u0026 any 3rd party APIs too. Plus NocoDB provides programmatic access to APIs so that you can build integrations with Zapier / Integromat and custom applications too.\nFeatures Rich Spreadsheet Interface ⚡ Basic Operations: Create, Read, Update and Delete on Tables, Fields, and Records ⚡ Fields Operations: Sort, Filter, Hide / Un-hide Fields ⚡ Multiple Views Types: Grid (By default), Gallery, Form View and Kanban View ⚡ View Permissions Types: Collaborative Views \u0026 Locked Views ⚡ Share Bases / Views: either Public or Private (with Password Protected) ⚡ Variant Cell Types: ID, Links, Lookup, Rollup, SingleLineText, Attachment, Currency, Formula and etc ⚡ Access Control with Roles : Fine-grained Access Control at different levels ⚡ and more … App Store for Workflow Automations We provide different integrations in three main categories. See App Store for details.\n⚡ Chat : Slack, Discord, Mattermost, and etc ⚡ Email : AWS SES, SMTP, MailerSend, and etc ⚡ Storage : AWS S3, Google Cloud Storage, Minio, and etc Programmatic Access We provide the following ways to let users invoke actions in a programmatic way. You can use a token (either JWT or Social Auth) to sign your requests for authorization to NocoDB.\n⚡ REST APIs ⚡ NocoDB SDK ⚡ SQL Access : Run SQL queries on your data source from NocoDB UI itself (Coming soon!) Sync Schema We allow you to sync schema changes if you have made changes outside NocoDB GUI. However, it has to be noted then you will have to bring your own schema migrations for moving from environment to others. See Sync Schema for details.\nAudit We are keeping all the user operation logs under one place. See Audit for details.\nWhy are we building this? Most internet businesses equip themselves with either spreadsheet or a database to solve their business needs. Spreadsheets are used by a Billion+ humans collaboratively every single day. However, we are way off working at similar speeds on databases which are way more powerful tools when it comes to computing. Attempts to solve this with SaaS offerings has meant horrible access controls, vendor lockin, data lockin, abrupt price changes \u0026 most importantly a glass ceiling on what’s possible in the future.\nOur Mission Our mission is to provide the most powerful no-code interface for databases which is Open Source to every single internet business in the world. This would not only democratise access to a powerful computing tool but also bring forth a billion+ people who will have radical tinkering-and-building abilities on internet.\nHow can I contribute to NocoDB’s development ? Please refer to here for the contribution guidelines.\n\u003cimg src=“https://static.scarf.sh/a.png?x-pxid=c12a77cc-855e-4602-8a0f-614b2d0da56a\" style={{margin: ‘0px’}} /\u003e","our-mission#Our Mission":"","where-can-i-join-the-nocodb-community#Where can I join the NocoDB community?":"Follow us for daily updates, content, and other activities with our community:\nYoutube Twitter Discord GitHub Community Forums LinkedIn Reddit ","why-are-we-building-this#Why are we building this?":""},"title":"Welcome"},"/showcase/":{"data":{"community-projects#Community Projects":"Have you built something with AutoCRUD? Share it with us!","featured-projects#Featured Projects":"Project 1 Description of the first project and its features.\nProject 2 Description of the second project and its features.","showcase#Showcase":"ShowcaseHere are some examples of projects built with AutoCRUD:"},"title":"Showcase"}}