{"/about/":{"data":{"about-my-app#About My App":"About My AppMy App is a powerful tool designed to help users accomplish their goals efficiently and effectively. This documentation site serves as a comprehensive guide to understanding and using My App.","contact#Contact":"For any inquiries, please reach out to us:\nGitHub: github.com/yourusername/your-repo Email: your.email@example.com ","our-mission#Our Mission":"To provide users with a seamless and intuitive experience while helping them achieve their objectives."},"title":"About"},"/blog/":{"data":{"blog#Blog":"BlogStay up to date with the latest AutoCRUD news, updates, and technical articles.","latest-posts#Latest Posts":"Check back soon for our first blog post!"},"title":"Blog"},"/docs/":{"data":{"features#Features":" Feature 1 Feature 2 Feature 3 ","need-help#Need Help?":"If you need help with My App, feel free to:\nCheck our FAQ section Report an issue Contact support ","quick-start#Quick Start":"Get started with My App in minutes:\nInstallation Guide Basic Usage Configuration ","welcome-to-my-app-documentation#Welcome to My App Documentation":"Welcome to My App DocumentationWelcome to the documentation for My App. Here you’ll find comprehensive guides and documentation to help you start working with My App as quickly as possible."},"title":"Documentation"},"/docs/getting-started/":{"data":{"":" 🌐 Version: Latest Get started with AutoCRUD by understanding its core concepts and components.\nWorkspacesWorkspaces in AutoCRUD are containers for your projects. Core Feature TablesTables are the foundation of your data structure. Database FlowsAutomate your workflows and create powerful.. Automation Global VariablesLearn how to use global variables… Configuration ","next-steps#Next Steps":"After familiarizing yourself with these core concepts, you can:\nFollow our step-by-step tutorials Explore advanced features Check out our API documentation Join our community ℹ️ Need help? Check our FAQ section or join our Discord community. ","quick-navigation#Quick Navigation":" Setting up your first workspace → Creating database tables → Building automation flows → Managing global variables → "},"title":"Getting Started"},"/docs/tables/":{"data":{"":"Tables are the core building blocks of your AutoCRUD application. They represent your data structure and define how information is stored and accessed.","advanced-features#Advanced Features":" Custom validation rules Computed columns Virtual fields Audit logging Access control ","table-basics#Table Basics":"Learn about:\nTable structure and schema Data types and relationships Indexes and constraints Views and filters ","working-with-tables#Working with Tables":" Creating tables Modifying table structure Managing relationships Creating views "},"title":"Tables"},"/docs/welcome/":{"data":{"":"","features#Features":"","how-can-i-contribute-to-autocruds-development-#How can I contribute to AutoCRUD\u0026rsquo;s development ?":"AutoCRUD is a no-code database platform that allows teams to collaborate and build applications with ease of a familiar and intuitive spreadsheet interface. This allows even non-developers or business users to become software creators.\nAutoCRUD works by connecting to any relational database and transforming them into a smart spreadsheet interface! This allows you to build no-code applications collaboratively with teams. AutoCRUD currently works with MySQL, PostgreSQL \u0026 SQLite (only in Open Source) databases.\nAlso, AutoCRUD’s app store allows you to build business workflows on views with combination of Slack, Microsoft Teams, Discord, Twilio, Whatsapp, Email \u0026 any 3rd party APIs too. Plus AutoCRUD provides programmatic access to APIs so that you can build integrations with Zapier / Integromat and custom applications too.\nFeatures Rich Spreadsheet Interface ⚡ Basic Operations: Create, Read, Update and Delete on Tables, Fields, and Records ⚡ Fields Operations: Sort, Filter, Hide / Un-hide Fields ⚡ Multiple Views Types: Grid (By default), Gallery, Form View and Kanban View ⚡ View Permissions Types: Collaborative Views \u0026 Locked Views ⚡ Share Bases / Views: either Public or Private (with Password Protected) ⚡ Variant Cell Types: ID, Links, Lookup, Rollup, SingleLineText, Attachment, Currency, Formula and etc ⚡ Access Control with Roles : Fine-grained Access Control at different levels ⚡ and more … App Store for Workflow Automations We provide different integrations in three main categories. See App Store for details.\n⚡ Chat : Slack, Discord, Mattermost, and etc ⚡ Email : AWS SES, SMTP, MailerSend, and etc ⚡ Storage : AWS S3, Google Cloud Storage, Minio, and etc Programmatic Access We provide the following ways to let users invoke actions in a programmatic way. You can use a token (either JWT or Social Auth) to sign your requests for authorization to AutoCRUD.\n⚡ REST APIs ⚡ AutoCRUD SDK ⚡ SQL Access : Run SQL queries on your data source from AutoCRUD UI itself (Coming soon!) Sync Schema We allow you to sync schema changes if you have made changes outside AutoCRUD GUI. However, it has to be noted then you will have to bring your own schema migrations for moving from environment to others. See Sync Schema for details.\nAudit We are keeping all the user operation logs under one place. See Audit for details.\nWhy are we building this? Most internet businesses equip themselves with either spreadsheet or a database to solve their business needs. Spreadsheets are used by a Billion+ humans collaboratively every single day. However, we are way off working at similar speeds on databases which are way more powerful tools when it comes to computing. Attempts to solve this with SaaS offerings has meant horrible access controls, vendor lockin, data lockin, abrupt price changes \u0026 most importantly a glass ceiling on what’s possible in the future.\nOur Mission Our mission is to provide the most powerful no-code interface for databases which is Open Source to every single internet business in the world. This would not only democratise access to a powerful computing tool but also bring forth a billion+ people who will have radical tinkering-and-building abilities on internet.\nHow can I contribute to AutoCRUD’s development ? Please refer to here for the contribution guidelines.\n\u003cimg src=“https://static.scarf.sh/a.png?x-pxid=c12a77cc-855e-4602-8a0f-614b2d0da56a\" style={{margin: ‘0px’}} /\u003e","our-mission#Our Mission":"","where-can-i-join-the-autocrud-community#Where can I join the AutoCRUD community?":"Follow us for daily updates, content, and other activities with our community:\nYoutube Twitter Discord GitHub Community Forums LinkedIn Reddit ","why-are-we-building-this#Why are we building this?":""},"title":"Welcome"},"/docs/workspaces/":{"data":{"":"Workspaces in AutoCRUD help you organize your projects and manage access control. Each workspace can contain multiple tables, flows, and configurations.","creating-a-workspace#Creating a Workspace":"To create a new workspace:\nClick on the “Workspaces” menu in the sidebar Select “New Workspace” Enter a name and description Configure workspace settings Click “Create” ","managing-workspaces#Managing Workspaces":"Learn how to:\nSet up your first workspace Configure workspace settings Manage team access Share workspaces ","what-is-a-workspace#What is a Workspace?":"A workspace is a container that helps you:\nOrganize related tables and data Manage team access and permissions Configure environment-specific settings Track usage and activity "},"title":"Workspaces"},"/showcase/":{"data":{"community-projects#Community Projects":"Have you built something with AutoCRUD? Share it with us!","featured-projects#Featured Projects":"Project 1 Description of the first project and its features.\nProject 2 Description of the second project and its features.","showcase#Showcase":"ShowcaseHere are some examples of projects built with AutoCRUD:"},"title":"Showcase"}}