{"/autocrud-doc/about/":{"data":{"about-my-app#About My App":"About My AppMy App is a powerful tool designed to help users accomplish their goals efficiently and effectively. This documentation site serves as a comprehensive guide to understanding and using My App.","contact#Contact":"For any inquiries, please reach out to us:\nGitHub: github.com/yourusername/your-repo Email: your.email@example.com ","our-mission#Our Mission":"To provide users with a seamless and intuitive experience while helping them achieve their objectives."},"title":"About"},"/autocrud-doc/blog/":{"data":{"blog#Blog":"BlogStay up to date with the latest AutoCRUD news, updates, and technical articles.","latest-posts#Latest Posts":"Check back soon for our first blog post!"},"title":"Blog"},"/autocrud-doc/docs/":{"data":{"features#Features":" Feature 1 Feature 2 Feature 3 ","need-help#Need Help?":"If you need help with My App, feel free to:\nCheck our FAQ section Report an issue Contact support ","quick-start#Quick Start":"Get started with My App in minutes:\nInstallation Guide Basic Usage Configuration ","welcome-to-my-app-documentation#Welcome to My App Documentation":"Welcome to My App DocumentationWelcome to the documentation for My App. Here you’ll find comprehensive guides and documentation to help you start working with My App as quickly as possible."},"title":"Documentation"},"/autocrud-doc/docs/flows/":{"data":{"flows-workflow-automation#Flows: Workflow Automation":"","getting-started#Getting Started":"Ready to build your first workflow? Start with our Creating Your First Flow guide.","key-features#Key Features":" Visual Builder: Intuitive drag-and-drop interface Multiple Trigger Types: Schedule, HTTP, On Demand Rich Node Library: Email, HTTP requests, Data operations, AI functions Real-time Monitoring: Track executions and debug issues Error Handling: Built-in retry mechanisms and error notifications ","what-youll-learn#What You\u0026rsquo;ll Learn":"Flows: Workflow AutomationFlows are the heart of AutoCRUD’s automation capabilities, allowing you to build powerful workflows that connect your tools and services without writing code.\nWhat You’ll Learn How to create flows with our visual workflow builder Different types of triggers to start your workflows Available nodes and their capabilities How to configure and test your flows Tips for managing and optimizing your workflows "},"title":"Flows"},"/autocrud-doc/docs/flows/creating-flows/":{"data":{"creating-your-first-flow#Creating Your First Flow":"Creating Your First FlowAutoCRUD’s visual flow builder makes it easy to create powerful automated workflows without writing code. This guide will walk you through creating your first flow.","example-simple-email-notification-flow#Example: Simple Email Notification Flow":"Let’s create a simple flow that sends an email when triggered:\nStart with a trigger node (e.g., HTTP trigger) Add a Send Email node Connect the trigger to the email node Configure the email node with recipient, subject, and content Save and test your flow ","next-steps#Next Steps":"Now that you’ve created your first flow, you can:\nExplore more complex workflows with multiple nodes Learn about Advanced Triggers Discover all available Node Types Implement Error Handling in your flows ","prerequisites#Prerequisites":" An AutoCRUD account with access to a workspace Basic understanding of the workflow concept ","step-1-access-the-flows-section#Step 1: Access the Flows Section":" Navigate to your workspace dashboard Click on the Flows icon in the left sidebar Click the Create Flow button in the top-right corner ","step-2-design-your-workflow#Step 2: Design Your Workflow":"Once in the flow builder, you’ll see a canvas where you can design your workflow:\nStart with a Trigger Node (automatically added) Use the + button or drag nodes from the node library to add actions Connect nodes by dragging from the output of one node to the input of another ","step-3-configure-your-trigger#Step 3: Configure Your Trigger":"Every flow starts with a trigger that determines when your workflow will run:\nClick on the trigger node to open its configuration panel Select a trigger type: On Schedule: Run at specified intervals HTTP: Triggered by a webhook On Demand: Manually triggered Configure the trigger settings as needed ","step-4-add-and-configure-action-nodes#Step 4: Add and Configure Action Nodes":"Add actions to your workflow to perform specific tasks:\nClick on the + button to add a node Select from available node types: Send Email: Send email notifications HTTP Request: Make API calls to external services Ask Question: Leverage AI for question answering And many more… Configure each node’s parameters as required ","step-5-test-your-flow#Step 5: Test Your Flow":"Before deploying your flow, you should test it to ensure it works as expected:\nClick the Play button in the toolbar to run your flow Monitor the execution in real-time Check node outputs to verify the results Make adjustments as needed ","step-6-save-and-activate-your-flow#Step 6: Save and Activate Your Flow":"Once you’re satisfied with your flow:\nGive your flow a descriptive name Click the Save button Activate your flow to make it live "},"title":"Creating Flows"},"/autocrud-doc/docs/flows/error-handling/":{"data":{"best-practices#Best Practices":"Follow these best practices for effective error handling:\nAnticipate Failures: Identify potential failure points and plan for them Validate Inputs: Check input data before performing operations Provide Context: Include helpful error messages and context data Log Everything: Maintain comprehensive logs for debugging Graceful Degradation: Design flows to function with reduced capabilities when services are unavailable Regular Monitoring: Set up monitoring to detect and respond to errors quickly ","debugging-and-troubleshooting#Debugging and Troubleshooting":"When errors occur, AutoCRUD provides tools to help you identify and fix the issues:\nExecution Logs Every flow execution is logged with detailed information:\nTimestamp of each step Input and output data for each node Error messages and stack traces Execution duration and status Visual Indicators The flow builder provides visual feedback on errors:\nRed highlights for nodes that encountered errors Warning icons for configuration issues Status indicators for overall flow health Testing Tools Use the built-in testing tools to identify and fix errors:\nTest individual nodes to isolate issues View intermediate outputs to trace data flow Simulate different input scenarios ","error-handling-in-flows#Error Handling in Flows":"Error Handling in FlowsEven the best-designed workflows can encounter errors. AutoCRUD provides robust error handling capabilities to help you build resilient flows that can recover from failures and provide meaningful feedback.","error-handling-options#Error Handling Options":"AutoCRUD provides several ways to handle errors in your flows:\n1. Node-Level Error Handling Each node can be configured with specific error handling behavior:\nRetry: Automatically retry the operation on failure Continue: Proceed to the next node despite errors Stop: Halt the flow execution on error Custom Error Path: Direct flow to a specific error handling branch 2. Try/Catch Patterns Implement a try/catch pattern in your flow design:\nCreate a main path for the “happy path” execution Create an alternative path for error handling Configure nodes to route to the error path when they fail 3. Error Notifications Set up notifications for when errors occur:\nEmail alerts when flows fail Logging to external monitoring systems Integration with chat platforms for real-time alerts ","examples#Examples":"API Rate Limit Handling If encounter \"Rate Limit Exceeded\" error: 1. Wait for specified cooldown period 2. Retry the request 3. If still failing after 3 attempts, send notification Data Validation Flow 1. Validate input data 2. If validation fails: a. Log detailed validation errors b. Send notification with specific issues c. Stop processing or route to cleanup actions Service Dependency Handling When external service is unavailable: 1. Try alternative service if available 2. Store request for later processing 3. Notify administrator of service outage ","implementing-error-handling#Implementing Error Handling":"Configure Retry Settings For transient errors, configure retry settings:\nSelect a node in your flow Open the node settings panel Navigate to the “Error Handling” tab Configure retry attempts, delays, and backoff strategy Sample Retry Configuration:\nMaximum Retries: 3 Initial Delay: 5 seconds Backoff Multiplier: 2 (doubles delay after each retry) Set Up Error Notification For critical workflows, set up error notifications:\nAdd a “Send Email” or “HTTP Request” node Connect it to the error path of your flow Configure it to send details about the error Include relevant context information for debugging Create Conditional Error Handling For sophisticated error handling, use conditional logic:\nAdd an “If Condition” node after a potential failure point Configure it to check for error status or codes Create different paths based on the error condition Implement appropriate recovery actions for each scenario ","next-steps#Next Steps":"Now that you’ve learned about error handling, explore how to Monitor and Manage your flows for optimal performance.","understanding-flow-errors#Understanding Flow Errors":"Errors in workflows can occur for various reasons:\nExternal Service Failures: APIs might be down or responding with errors Invalid Data: Input data might not match expected formats Permission Issues: Lack of necessary permissions for certain operations Timeout Errors: Operations taking too long to complete Resource Limitations: Hitting quotas or resource constraints "},"title":"Error Handling"},"/autocrud-doc/docs/flows/monitoring/":{"data":{"advanced-monitoring#Advanced Monitoring":"Custom Dashboards Create custom dashboards for monitoring specific metrics:\nDefine the metrics you want to track Configure visualization preferences Set up refresh intervals Share dashboards with team members Logging Integration Integrate with external logging systems:\nSend execution logs to centralized logging platforms Configure log detail levels Implement structured logging for better analysis Set up log retention policies ","alerts-and-notifications#Alerts and Notifications":"Set up alerts to stay informed about your workflow performance:\nExecution Alerts Configure notifications for execution events:\nFlow start and completion Execution failures Long-running executions Custom condition triggers System Notifications Receive updates about system-level events:\nSchedule changes Version updates Maintenance notices Resource usage warnings ","best-practices#Best Practices":" Regular Audits: Periodically review all active flows for relevance and performance Documentation: Maintain clear documentation about each flow’s purpose and operation Testing: Test flows thoroughly after any changes Incremental Changes: Make small, incremental changes rather than large overhauls Consistent Naming: Use a consistent naming convention for flows and nodes Clean Up: Remove or archive obsolete flows to maintain a clean workspace ","execution-monitoring#Execution Monitoring":"Real-time Execution Tracking Monitor your flow executions in real-time:\nClick on a flow to open it Navigate to the “Executions” tab See active and completed executions View detailed execution information Execution Details For each execution, you can view:\nStart and end times Duration Status (Success, Failed, Running) Input and output data for each node Error messages if applicable Click on any execution record to see the full details, including the execution path and node-by-node results.","flow-overview-dashboard#Flow Overview Dashboard":"The Flows Overview page provides a centralized view of all your workflows:\nSee all flows in your workspace View node counts for each flow Check schedule configurations Monitor execution status Access creation and modification dates ","managing-workflows#Managing Workflows":"Activating and Deactivating Flows Control when your flows are active:\nNavigate to the Flows Overview page Find the flow you want to manage Use the toggle switch to activate or deactivate Deactivated flows won’t run automatically but can still be triggered manually Version Control Keep track of changes to your workflows:\nEach saved change creates a new version View the version history of any flow Compare different versions Revert to previous versions if needed Duplicating Flows Create copies of existing flows:\nOpen the flow you want to duplicate Click the “Duplicate” option from the menu Give the new flow a unique name Modify as needed for your new use case Exporting and Importing Share workflows between workspaces:\nExport flows as JSON files Import flows from JSON format Clone workflows across environments ","monitoring-and-managing-flows#Monitoring and Managing Flows":"Monitoring and Managing FlowsOnce you’ve built and deployed your workflows, it’s essential to monitor their performance and manage them effectively. AutoCRUD provides comprehensive tools to help you keep your workflows running smoothly.","next-steps#Next Steps":"Now that you understand how to monitor and manage your flows, learn about Variables and Data Handling to make your workflows more dynamic and flexible.","performance-metrics#Performance Metrics":"AutoCRUD tracks key performance metrics for your flows:\nExecution Count: Number of times a flow has run Success Rate: Percentage of successful executions Average Duration: Typical execution time Error Frequency: Rate of errors by type Resource Usage: Computational resources consumed Use these metrics to identify bottlenecks, optimize performance, and ensure reliability.","troubleshooting-common-issues#Troubleshooting Common Issues":"Flow Not Triggering If your flow isn’t triggering as expected:\nCheck if the flow is activated Verify the trigger configuration Look for error messages in the execution logs Ensure any external triggers are sending data correctly Slow Execution If your flow is running slowly:\nIdentify bottleneck nodes using duration metrics Check for unnecessary operations Optimize data processing steps Consider refactoring complex flows into multiple simpler flows High Error Rates If your flow has a high error rate:\nReview execution logs to identify patterns Check external service dependencies Implement more robust error handling Validate input data earlier in the flow "},"title":"Monitoring \u0026 Management"},"/autocrud-doc/docs/flows/nodes/":{"data":{"advanced-nodes#Advanced Nodes":"If Condition Add branching logic to your workflows based on conditions.\nKey Features:\nMultiple condition types Comparison operators Complex logical expressions Variable reference support Configuration Options:\nCondition Type: Equal, Not Equal, Greater Than, etc. Value A: First value to compare Value B: Second value to compare Operator: AND, OR, NOT Generate Image Create images using AI-powered image generation.\nKey Features:\nText-to-image conversion Style customization Size and format options Integration with other nodes Configuration Options:\nPrompt: Description of the image to generate Style: Visual style preference Size: Dimensions of the output image Format: Output file format Embeddings Generate vector embeddings for text and data.\nKey Features:\nConvert text to vector representations Similarity search capabilities Integration with databases Support for various embedding models Configuration Options:\nText: Input text to convert Model: Embedding model to use Dimensions: Vector dimension size Output Format: How to structure the result Information Extractor Schema Extract structured data from unstructured content.\nKey Features:\nIntelligent field extraction Schema-based parsing Support for multiple input formats Customizable output structure Configuration Options:\nInput: Text or data to process Schema: Definition of what to extract Format: Input format type Output: How to structure the result Content Moderation Filter and analyze content for inappropriate material.\nKey Features:\nText and image moderation Customizable sensitivity levels Detailed analysis reports Automated actions based on results Configuration Options:\nContent: Material to moderate Categories: Types of content to flag Threshold: Sensitivity level Action: What to do when content is flagged ","basic-nodes#Basic Nodes":"Send Email Send emails through various providers like SMTP, AWS SES, and more.\nKey Features:\nConfigure sender and recipient information Support for HTML content Attachment capabilities Template variables support Configuration Options:\nTo: Recipient email address Subject: Email subject line Body: Email content From: Sender email address (optional) CC/BCC: Additional recipients (optional) HTTP Request Make API calls to external services or fetch data from the web.\nKey Features:\nSupport for all HTTP methods (GET, POST, PUT, DELETE, etc.) Custom headers and query parameters Authentication options JSON, XML, and form data handling Configuration Options:\nURL: The endpoint to request Method: HTTP method to use Headers: Request headers Body: Request body content Query Parameters: URL parameters Ask Question Leverage AI to generate responses to questions.\nKey Features:\nNatural language processing Contextual understanding Customizable responses Integration with workflow variables Configuration Options:\nQuestion: The prompt or query Context: Additional context information Response Format: How the answer should be structured ","best-practices#Best Practices":" Name Your Nodes: Give descriptive names to make your flow easier to understand Organize Your Layout: Arrange nodes logically from left to right Use Comments: Add notes to explain complex parts of your workflow Test Incrementally: Verify each node works before connecting the next one Handle Errors: Include error handling for critical nodes ","flow-nodes#Flow Nodes":"Flow NodesNodes are the building blocks of your workflows in AutoCRUD. Each node performs a specific action, from sending emails to making HTTP requests to processing data. This guide covers all available node types and how to use them.","next-steps#Next Steps":"Now that you understand the available nodes, learn how to implement Error Handling in your flows.","working-with-nodes#Working with Nodes":"Adding Nodes to a Flow Click the “+” button in the flow builder Select the desired node type from the menu Position the node on the canvas Connect it to other nodes in your flow Configuring Nodes Click on a node to select it Use the configuration panel on the right to set options Required fields are marked with an asterisk (*) Click “Apply” or “Save” to confirm changes Connecting Nodes Click and drag from the output handle of one node Release on the input handle of another node A connection line will appear between the nodes Data will flow through this connection during execution Testing Node Output Most nodes have a “Test” button that allows you to:\nExecute just that node View the output data Troubleshoot configuration issues Verify correct functionality "},"title":"Node Types"},"/autocrud-doc/docs/flows/tables-integration/":{"data":{"advanced-table-automation-techniques#Advanced Table Automation Techniques":"Batch Processing Process multiple records in a single flow run:\nUse a scheduled trigger or manual button Find records matching your criteria Loop through the records Process each record with your business logic Update processing status Conditional Record Creation Create records based on complex conditions:\nTrigger on an event Evaluate conditions using If nodes Create different record types based on conditions Link the new records appropriately Cascading Updates Update related records automatically:\nTrigger when a parent record changes Find all related child records Update the child records based on parent changes Optionally trigger further workflows Form to Table Automation Create complete data collection workflows:\nDesign a form view for data entry Trigger a flow when the form is submitted Validate and process the submitted data Create records in multiple related tables Send confirmation notifications ","best-practices#Best Practices":"Performance Considerations Limit the frequency of triggers for high-volume tables Use indexing for fields used in filtering Batch operations when possible Implement error handling and retry logic Monitor flow execution times Data Integrity Validate data before creating or updating records Implement transaction-like patterns for multi-table updates Create audit trails for important changes Use rollback mechanisms for failed operations Maintenance and Monitoring Document your automations Set up monitoring for failed flows Review flow execution logs regularly Test flows thoroughly before deployment Use descriptive naming for flows and nodes ","common-automation-scenarios#Common Automation Scenarios":"Data Enrichment Automatically enhance records with additional data:\nTrigger on record creation/update Use HTTP Request nodes to fetch external data Update the record with the enriched information Example: Adding company information to a contact record by looking up their email domain\nApproval Workflows Create multi-step approval processes:\nTrigger when a record status changes to “Pending Approval” Send notification to approvers Create approval tasks or records Update the original record based on approval decisions Data Synchronization Keep multiple tables or systems in sync:\nTrigger when records change Transform data as needed Update corresponding records in other tables or external systems Log synchronization activities Notifications and Alerts Send alerts based on table conditions:\nTrigger on record updates Check if conditions meet alert criteria Send notifications via email, Slack, or other channels Update record to acknowledge the alert ","integrating-tables-with-flows#Integrating Tables with Flows":"Integrating Tables with FlowsOne of the most powerful features of AutoCRUD is the ability to connect your tables with automated workflows. This guide shows you how to use flows to automate operations on your tables, creating powerful data-driven applications.","next-steps#Next Steps":"Now that you know how to integrate tables with flows, explore:","table-operation-nodes#Table Operation Nodes":"AutoCRUD provides several nodes for interacting with tables in your flows:\nCreate Record Node Add new records to a table:\nAdd a “Create Record” node to your flow Select the target table Map data to the fields you want to populate Configure additional options (error handling, etc.) Example: Creating a customer record after a form submission\n{ \"name\": \"{{trigger.data.name}}\", \"email\": \"{{trigger.data.email}}\", \"createdAt\": \"{{now()}}\" } Find Records Node Query tables to find specific records:\nAdd a “Find Records” node to your flow Select the table to query Configure filter conditions Specify sorting and limits if needed Example: Finding all overdue tasks\n{ \"where\": { \"dueDate\": { \"lt\": \"{{now()}}\" }, \"status\": { \"ne\": \"Completed\" } }, \"limit\": 100, \"sort\": [{ \"field\": \"dueDate\", \"direction\": \"asc\" }] } Update Record Node Modify existing records in a table:\nAdd an “Update Record” node to your flow Select the target table Specify how to identify the record(s) to update Define the fields and values to update Example: Marking a task as completed\n{ \"where\": { \"id\": \"{{trigger.data.recordId}}\" }, \"update\": { \"status\": \"Completed\", \"completedAt\": \"{{now()}}\" } } Delete Record Node Remove records from a table:\nAdd a “Delete Record” node to your flow Select the target table Specify how to identify the record(s) to delete Configure confirmation and safety options Example: Deleting old archive records\n{ \"where\": { \"createdAt\": { \"lt\": \"{{addDays(now(), -365)}}\" }, \"status\": \"Archived\" } } ","table-related-flow-triggers#Table-Related Flow Triggers":"Record Created Trigger Start a flow when a new record is created in a table:\nCreate a new flow Select “Record Created” as the trigger type Choose the table to monitor Configure any additional options (filters, etc.) The flow will run each time a new record is created Use cases: Send welcome emails, create related records, initiate approval processes\nRecord Updated Trigger Trigger a flow when a record in a table is modified:\nCreate a new flow Select “Record Updated” as the trigger type Choose the table to monitor Optionally specify which fields to watch for changes Configure any additional filters Use cases: Notification systems, status updates, audit logging, data synchronization\nRecord Deleted Trigger Run a flow when a record is deleted from a table:\nCreate a new flow Select “Record Deleted” as the trigger type Choose the table to monitor Configure any additional options Use cases: Cleanup related records, archive data, send notifications\nView Button Trigger Add a custom button to a table view that triggers a flow:\nCreate a new flow Select “View Button” as the trigger type Choose the table and view Configure the button appearance and behavior The flow will run when users click the button Use cases: Bulk operations, custom actions, process initiation","troubleshooting#Troubleshooting":"Common Issues Issue: Flow not triggering on record changes Solution: Check trigger configuration and ensure it matches the expected changes\nIssue: Record updates not working Solution: Verify record identification conditions and field mappings\nIssue: Flow running too slowly Solution: Optimize database queries, reduce complexity, batch operations\nIssue: Circular update issues Solution: Implement guards against recursive triggering","understanding-table-automation#Understanding Table Automation":"By connecting tables with flows, you can:\nTrigger workflows when table data changes Automatically update records based on conditions Process data and perform calculations Connect your table data with external services Build complete business processes around your data "},"title":"Tables \u0026 Flows Integration"},"/autocrud-doc/docs/flows/triggers/":{"data":{"available-trigger-types#Available Trigger Types":"On Schedule Trigger Schedule your workflows to run at specific times or intervals.\nFeatures:\nRun on a cron schedule (e.g., every hour, daily, weekly) Set specific dates and times for execution Configure timezone settings Use Cases:\nDaily data synchronization Weekly report generation Periodic cleanup tasks HTTP Trigger Trigger your workflows via webhooks when external events occur.\nFeatures:\nUnique webhook URL for each flow Support for GET, POST, PUT, DELETE methods Access to request headers, body, and query parameters Use Cases:\nIntegrating with third-party services Responding to form submissions Processing webhook notifications On Demand Trigger Manually trigger your workflows when needed.\nFeatures:\nSimple button to execute the flow Optional input parameters Immediate execution Use Cases:\nTesting workflows during development One-time data processing tasks Manual approval processes ","best-practices#Best Practices":" Choose the Right Trigger: Select the most appropriate trigger type for your automation needs Document Webhook URLs: Keep track of webhook URLs for HTTP triggers Test Thoroughly: Always test your triggers before deploying to production Monitor Execution: Regularly check trigger execution logs for issues Set Reasonable Schedules: Avoid scheduling too many flows at the same time ","configuring-triggers#Configuring Triggers":"Basic Configuration Click on the trigger node in your flow Select the desired trigger type Configure the specific settings for that trigger Save your changes Advanced Options Depending on the trigger type, you may have access to advanced options:\nRetry Settings: Configure automatic retries on failure Timeout Settings: Set maximum execution time Input Parameters: Define expected input data Error Handling: Configure actions on trigger failure ","examples#Examples":"Daily Database Backup Trigger Type: On Schedule Schedule: Daily at 2:00 AM Customer Support Ticket Handler Trigger Type: HTTP Method: POST Endpoint: /api/tickets Manual Data Import Process Trigger Type: On Demand Input Parameters: File Path ","flow-triggers#Flow Triggers":"Flow TriggersTriggers are the starting points of your workflows. They determine when and how your flow will be executed. AutoCRUD offers several trigger types to suit different automation needs.","troubleshooting#Troubleshooting":"If your trigger isn’t working as expected:\nCheck the trigger configuration settings Verify that any external systems are sending data correctly Review execution logs for error messages Test the trigger manually if possible Ensure your workflow has the necessary permissions "},"title":"Triggers"},"/autocrud-doc/docs/flows/variables/":{"data":{"best-practices#Best Practices":"Follow these best practices for effective variable usage:\nDescriptive Names: Use clear, descriptive variable names Documentation: Add descriptions to global variables Type Consistency: Maintain consistent data types Default Values: Provide default values when possible Validation: Validate variable values before using them Security: Don’t store sensitive data in plaintext variables Organization: Group related variables logically ","common-variable-patterns#Common Variable Patterns":"Configuration Variables Store configuration in global variables:\nAPI endpoints Default values Feature flags Environment-specific settings Data Passing Pass data between different parts of your flow:\nStore intermediate results Pass user inputs through multiple steps Accumulate results across iterations Conditional Logic Use variables for dynamic behavior:\nChange flow behavior based on variable values Implement different paths based on data Toggle features on/off ","data-transformation#Data Transformation":"AutoCRUD provides several ways to transform and manipulate data:\nUsing Expressions Use expressions to transform data:\n{{ nodes.inputNode.output.value * 2 }} {{ \"Hello, \" + nodes.nameInput.output.name }} JSON Transformation Node For complex data transformations:\nAdd a “Transform” node to your flow Define the transformation using a mapping interface Connect it to input and output nodes Code Node For advanced transformations:\nAdd a “Code” node to your flow Write JavaScript/TypeScript code Access input variables and produce output // Example code in a Code node const input = $input; const transformed = { fullName: `${input.firstName} ${input.lastName}`, age: input.age, isAdult: input.age \u003e= 18, }; return transformed; ","data-types#Data Types":"AutoCRUD workflows support various data types:\nStrings: Text values Numbers: Numeric values Booleans: True/false values Arrays: Lists of values Objects: Key-value pairs Dates: Date and time values Null: Empty/no value Each data type has specific operations and functionality available.","troubleshooting-variables#Troubleshooting Variables":"Common issues and solutions:\nVariable Not Found If a variable isn’t available:\nCheck the variable name and syntax Verify the node producing the variable is upstream Check for typos in the variable reference Ensure the variable is within scope Incorrect Data Type If a variable has the wrong data type:\nUse transformation nodes to convert the type Add explicit type conversion in expressions Validate data earlier in the flow Variable Value Unexpected If a variable doesn’t contain expected data:\nAdd a “Debug” node to inspect the variable value Check upstream nodes for correct output Verify the data source is providing expected values ","types-of-variables#Types of Variables":"AutoCRUD supports several types of variables:\nGlobal Variables Global variables are available across all flows in your workspace:\nAccessible from any flow Set through the Variables section Great for configuration values, API keys, etc. Centralized management for easier updates Flow Variables Flow variables are specific to a single flow:\nDefined within a flow Used for flow-specific data Not accessible from other flows Reset with each flow execution Node Output Variables Each node in your flow produces output that can be used as variables:\nAutomatically available to downstream nodes Referenced using a special syntax Contains all data produced by the node Structured as objects with properties ","variables-and-data-handling#Variables and Data Handling":"Variables and Data HandlingVariables are essential for building dynamic and reusable workflows in AutoCRUD. They allow you to store, transform, and pass data between nodes in your flows, making your automations more powerful and flexible.","working-with-arrays#Working with Arrays":"Arrays (lists) are commonly used in workflows:\nIterating Over Arrays Process each item in an array:\nAdd a “Loop” node to your flow Connect it to a node that outputs an array Configure subsequent nodes to process each item Array Operations Perform common array operations:\nMap: Transform each item in an array Filter: Select items matching criteria Reduce: Combine array items into a single value Find: Locate specific items in an array ","working-with-objects#Working with Objects":"Objects (key-value pairs) help organize complex data:\nAccessing Object Properties Access properties using dot notation:\n{{ nodes.userData.output.user.address.city }} Creating and Modifying Objects Create or modify objects using expressions:\n{ \"name\": {{ nodes.inputNode.output.name }}, \"email\": {{ nodes.inputNode.output.email }}, \"createdAt\": {{ \"now\" | date }} } ","working-with-variables#Working with Variables":"Accessing Variables You can access variables in most node configuration fields using the following syntax:\nGlobal Variables: {{ globals.variableName }} Flow Variables: {{ flow.variableName }} Node Outputs: {{ nodes.nodeName.output.propertyName }} Setting Variables There are multiple ways to set variable values:\nGlobal Variables Dashboard:\nNavigate to the Variables section Click “Add Variable” Enter name, description, and value Save changes Set Variable Node:\nAdd a “Set Variable” node to your flow Configure variable name and value Connect it in your flow Node Outputs:\nOutput from each node is automatically available as variables No explicit action needed to create these variables Variable Scope and Lifecycle Understanding variable scope is important:\nGlobal Variables: Persist across all flows and executions Flow Variables: Exist only during a single flow execution Node Output Variables: Available only to downstream nodes in the same execution "},"title":"Variables \u0026 Data Handling"},"/autocrud-doc/docs/getting-started/":{"data":{"":"Get started with AutoCRUD by understanding its core concepts and components.\nWorkspacesWorkspaces in AutoCRUD are containers for your projects. Core Feature TablesTables are the foundation of your data structure. Database FlowsAutomate your workflows and create powerful.. Automation Global VariablesLearn how to use global variables… Configuration ","next-steps#Next Steps":"After familiarizing yourself with these core concepts, you can:\nFollow our step-by-step tutorials Explore advanced features Check out our API documentation Join our community ℹ️ Need help? Check our FAQ section or join our Discord community. ","quick-navigation#Quick Navigation":" Setting up your first workspace → Creating database tables → Building automation flows → Managing global variables → "},"title":"Getting Started"},"/autocrud-doc/docs/resources/":{"data":{"accessing-resources#Accessing Resources":"To access the Resources section:\nNavigate to your workspace Click on the Resources item in the left sidebar ","adding-a-new-resource#Adding a New Resource":"To add a new resource:\nNavigate to the Resources section Click the Add Resource button (or similar option in your interface) In the dialog that appears: Select the resource type Enter the required connection details Configure any additional settings Test the connection if available Save the resource ","managing-resources#Managing Resources":"Searching for Resources If you have many resources, you can use the search function:\nEnter your search term in the Search resources… box Optionally, use the Filter by Type dropdown to narrow down results The list will filter to show only resources that match your criteria Viewing Resource Details To see details about a particular resource:\nFind the resource in the list Click on it to view its details You’ll see information such as: Type of resource Date added Connection status Usage statistics (if available) Editing Resources To modify an existing resource:\nFind the resource in the list Click the menu (⋮) button for that resource Select Edit from the menu Update the settings as needed Save your changes Deleting Resources To remove a resource you no longer need:\nFind the resource in the list Click the menu (⋮) button for that resource Select Delete from the menu Confirm the deletion when prompted Warning: Deleting a resource may break flows that use it. Be sure to update any references to the resource before deletion.","next-steps#Next Steps":"Now that you understand resources, learn about:\nManaging Global Variables Building Automated Workflows ","resource-types#Resource Types":"AutoCRUD supports various types of resources:\nAPI Keys Credentials for authenticating with external APIs:\nREST API keys OAuth tokens Service account credentials Personal access tokens Database Connections Connections to external databases:\nSQL databases NoSQL databases Data warehouses Cloud database services Integration Platforms Connections to third-party integration services:\nZapier IFTTT Microsoft Power Automate MuleSoft Storage Services Connections to external storage:\nAWS S3 Google Cloud Storage Azure Blob Storage Dropbox ","resources-in-autocrud#Resources in AutoCRUD":"","security-considerations#Security Considerations":"Protecting Sensitive Resources All credentials are encrypted at rest API keys and tokens are never displayed in plain text after creation Access to resources is controlled by workspace permissions Consider using environment-specific resources for development vs. production Best Practices Regularly rotate API keys and credentials Use the principle of least privilege when creating service accounts Monitor usage of your resources to detect unusual activity Document the purpose and ownership of each resource ","troubleshooting#Troubleshooting":"Issue: Connection failed for a resource Solution: Verify the credentials and ensure the external service is available\nIssue: Resource not appearing in flows Solution: Check resource permissions and ensure it’s properly configured\nIssue: Authentication errors when using a resource Solution: The API key or token may have expired; try refreshing or regenerating it","understanding-resources#Understanding Resources":"Resources in AutoCRUD represent connections to external systems and services. They provide a centralized way to manage:\nAPI credentials External service connections Authentication tokens Integration points ","using-resources-in-flows#Using Resources in Flows":"Resources can be used in various parts of your flows:\nIn HTTP Requests For API resources:\nIn a HTTP Request node, select the resource from the dropdown The authentication headers will be automatically included Configure the endpoint path and method as needed In Database Operations For database connections:\nIn a Database Query node, select the database resource Write your query or select operations The connection details will be handled automatically ","what-youll-learn#What You\u0026rsquo;ll Learn":"Resources in AutoCRUDResources in AutoCRUD allow you to configure and manage connections to external services and APIs. These connections can then be used in your flows to integrate with third-party systems and extend the functionality of your workspace.\nWhat You’ll Learn How to add and configure different types of resources Ways to manage API keys and external connections Best practices for resource management Security considerations for external integrations "},"title":"Resources"},"/autocrud-doc/docs/settings/":{"data":{"accessing-settings#Accessing Settings":"To access workspace settings:\nNavigate to your workspace Click on the Settings icon in the left sidebar Select the category of settings you want to configure ","key-features#Key Features":" Comprehensive Configuration: Control all aspects of your workspace Team Management: Invite and manage collaborators with different permission levels Visual Customization: Select from predefined themes or create your own Security Controls: Manage access permissions and security settings ","settings-categories#Settings Categories":"AutoCRUD workspace settings are organized into three main categories:\nGeneral Settings Basic workspace configuration, including:\nWorkspace name and description Information management Danger zone options for workspace deletion Learn more about General Settings\nAccess Management Control who can access your workspace and what they can do:\nInvite collaborators Manage permissions Control access levels (Admin, Editor, Viewer) Learn more about Access Management\nAppearance Settings Customize how your workspace looks:\nSelect from predefined themes Create custom themes Configure color schemes Learn more about Appearance Settings","what-youll-learn#What You\u0026rsquo;ll Learn":"Workspace SettingsSettings in AutoCRUD allow you to customize and configure your workspace according to your specific needs. From the Settings section, you can manage workspace details, control access permissions, and personalize the appearance of your environment.\nWhat You’ll Learn How to configure general workspace settings Ways to manage access and permissions for collaborators How to customize the appearance and theme of your workspace Best practices for workspace configuration ","workspace-settings#Workspace Settings":""},"title":"Settings"},"/autocrud-doc/docs/settings/access/":{"data":{"access-management#Access Management":"Access ManagementThe Access Management section allows you to control who has access to your workspace and what level of permissions they have. This is essential for team collaboration while maintaining appropriate security controls.","accessing-access-management-settings#Accessing Access Management Settings":" Navigate to your workspace Click on the Settings icon in the left sidebar Select the Access tab ","best-practices-for-access-management#Best Practices for Access Management":" Principle of Least Privilege: Grant only the permissions necessary for each user’s role Regular Audits: Periodically review who has access to your workspace Offboarding Process: Immediately remove access when someone leaves your team Role Documentation: Document which roles are assigned to different team members Clear Ownership: Ensure there’s always at least one Admin for each workspace ","finding-collaborators#Finding Collaborators":"If you have many collaborators, you can use the search function to find specific people:\nClick the search field at the top of the collaborator list Enter the name or email address you’re looking for The list will filter to show matching results ","inviting-collaborators#Inviting Collaborators":"To invite new members to your workspace:\nClick the Invite Collaborator button in the top-right corner In the dialog that appears, enter the new member’s email address Select the appropriate role (Admin, Editor, or Viewer) Click Invite to send the invitation The invited collaborator will receive an email with instructions to join your workspace. Their status will show as “PENDING” until they accept the invitation.","managing-existing-collaborators#Managing Existing Collaborators":"The Access Management page displays a list of all current collaborators with the following information:\nCollaborator: Email address and profile initial Permission: Current role assignment Invited by: Who sent the invitation Status: Whether the invitation is ACTIVE or PENDING Invited On: Date and time when the invitation was sent Changing Permissions To change a collaborator’s role:\nFind the collaborator in the list Click on their current role in the Permission column Select the new role from the dropdown menu The change takes effect immediately Removing Collaborators To remove someone’s access to your workspace:\nFind the collaborator in the list Click the three-dot menu (⋮) at the end of their row Select Delete from the menu Confirm the removal when prompted ","next-steps#Next Steps":"After setting up access management, you may want to explore:\nConfiguring General Settings Customizing Workspace Appearance Collaboration Features ","troubleshooting#Troubleshooting":"Issue: Invitation email not received Solution: Check spam folders, verify the email address, or resend the invitation\nIssue: Cannot change a user’s role Solution: Ensure you have Admin permissions yourself\nIssue: Too many collaborators Solution: Check your subscription limits, you may need to upgrade your plan\nIssue: Collaborator shows as PENDING for too long Solution: Ask the collaborator to check their email or resend the invitation","understanding-user-roles#Understanding User Roles":"AutoCRUD offers different role types to control what users can do within your workspace:\nRole Description Capabilities Admin Full administrative control Can manage settings, members, and all content Editor Can create and modify content Can create and edit tables and flows Viewer Read-only access Can only view tables and flows, cannot edit "},"title":"Access Management"},"/autocrud-doc/docs/settings/appearance/":{"data":{"accessing-appearance-settings#Accessing Appearance Settings":" Navigate to your workspace Click on the Settings icon in the left sidebar Select the Appearance tab ","appearance-settings#Appearance Settings":"Appearance SettingsAppearance settings allow you to customize the visual aspects of your workspace. You can choose from predefined themes or create your own custom theme to match your preferences or brand identity.","best-practices#Best Practices":" Brand Consistency: For business workspaces, consider using colors that match your company’s brand Readability: Ensure there’s enough contrast between text and background colors User Preference: Remember that themes are user-specific, so each team member can select their preferred theme Testing: Test custom themes on different screens to ensure they look good on various devices ","creating-a-custom-theme#Creating a Custom Theme":"For more personalization, you can create your own theme by customizing colors:\nIn the Appearance settings, scroll to the Customize Theme section Configure the following color settings: Header Background: The background color of the top navigation bar Header Text: Text color for the header section Button Background: Default button color Additional color options may be available Enter color values in hexadecimal format (#RRGGBB) See the changes applied in real-time Click Save Theme to permanently apply your custom theme Color Selector For each color setting:\nClick on the color swatch to open the color picker Select a color visually from the picker Or enter a specific hex code if you know the exact color you want The changes are previewed immediately Resetting Colors If you want to start over:\nClick the Reset button in the Customize Theme section This will revert all custom color settings to their defaults You’ll need to save the theme after resetting ","next-steps#Next Steps":"After customizing your workspace appearance, you may want to explore:\nConfiguring General Settings Managing Access and Permissions ","selecting-a-predefined-theme#Selecting a Predefined Theme":"To select a predefined theme:\nBrowse through the available themes in the Appearance settings Click on a theme card to preview it The theme is applied immediately so you can see how it looks No need to save - your selection is automatically preserved ","theme-management#Theme Management":"Sharing Themes Currently, themes are specific to your user account and apply to all workspaces you access. Team members will need to set their own theme preferences.\nTheme Persistence Your theme selection is remembered across sessions. When you log out and log back in, your chosen theme will still be applied.","theme-options#Theme Options":"AutoCRUD offers several predefined themes that you can choose from:\nLight Themes Clean and bright themes for daytime use:\nAmber: Warm yellow tones Emerald: Fresh green color scheme Sky: Calming blue palette Rose: Soft pink accents Dark Themes Themes with darker backgrounds for reduced eye strain:\nMidnight: Classic dark blue theme Obsidian: Deep black theme Forest: Dark green theme Cherry: Deep red theme ","troubleshooting#Troubleshooting":"Issue: Custom colors not saving Solution: Ensure you click the “Save Theme” button after making changes\nIssue: Difficulty seeing text after changing colors Solution: Aim for high contrast between text and background colors\nIssue: Theme appears inconsistent across pages Solution: Refresh the browser or try clearing your cache"},"title":"Appearance Settings"},"/autocrud-doc/docs/settings/general/":{"data":{"accessing-general-settings#Accessing General Settings":" Navigate to your workspace Click on the Settings icon in the left sidebar Select the General tab ","best-practices#Best Practices":" Regular Updates: Keep your workspace name and description up to date as projects evolve Clear Communication: Inform team members before making significant changes to workspace settings Access Control: Limit access to general settings to trusted administrators Documentation: Document important workspace settings for reference ","danger-zone#Danger Zone":"The Danger Zone contains actions that can permanently affect your workspace. These actions require careful consideration before proceeding.\nDeleting a Workspace Deleting a workspace is a permanent action that cannot be undone. When you delete a workspace:\nAll tables, records, and views will be permanently removed All flows and automations will be deleted All workspace settings and configurations will be lost All members will lose access to the workspace Before deleting a workspace, consider:\nExporting important data for backup Informing all team members Verifying that you have the necessary permissions To delete a workspace:\nNavigate to the Danger Zone section at the bottom of General Settings Review the warning message Click the Delete button Confirm the deletion in the prompt that appears Warning: Once deleted, all data will be permanently removed including all tables, views, and workflows. This action cannot be undone.","general-settings#General Settings":"General SettingsGeneral settings allow you to manage the fundamental information about your workspace, including workspace name, description, and critical actions like deletion.","next-steps#Next Steps":"After configuring general settings, you may want to explore:\nManaging Access and Permissions Customizing Workspace Appearance ","troubleshooting#Troubleshooting":"Issue: Changes not saving Solution: Refresh the page and try again, ensure you have proper permissions\nIssue: Cannot update workspace information Solution: Verify you have admin privileges for the workspace\nIssue: Error when trying to delete workspace Solution: Ensure you’re the workspace owner and all conditions for deletion are met","workspace-details#Workspace Details":"The Workspace Details section allows you to update basic information about your workspace:\nWorkspace Name Your workspace name identifies your workspace throughout the platform. A good name should:\nClearly indicate the purpose of the workspace Be concise but descriptive Be easily recognizable by team members To update your workspace name:\nEnter the new name in the Workspace Name field Click Update Workspace to save changes Description The workspace description helps team members understand the purpose of the workspace. It should:\nBriefly explain what the workspace is used for Outline the main objectives or projects Provide context for new members To update your description:\nEnter the new description in the Description field Click Update Workspace to save changes "},"title":"General Settings"},"/autocrud-doc/docs/tables/":{"data":{"advanced-features#Advanced Features":" Custom validation rules Computed columns Virtual fields Audit logging Access control ","getting-started#Getting Started":"Ready to build your first table? Start with our Creating Tables guide.","key-features#Key Features":" Intuitive Interface: Familiar spreadsheet-like experience Multiple View Types: Grid, Kanban, Form, and more Rich Data Types: Text, numbers, attachments, relationships, and more Advanced Filtering: Create powerful filters to find exactly what you need Collaboration: Work together with your team on the same data Automation: Connect tables to flows for powerful automations ","table-basics#Table Basics":"Learn about:\nTable structure and schema Data types and relationships Indexes and constraints Views and filters ","table-structure#Table Structure":"Each table in AutoCRUD consists of:\nRecords: Rows of data (similar to rows in a spreadsheet) Fields: Columns that define data types (similar to columns in a spreadsheet) Views: Different ways to visualize and interact with your data Filters: Conditions to show only relevant data Sorts: Orders to arrange your data logically ","tables-data-management-in-autocrud#Tables: Data Management in AutoCRUD":"","what-youll-learn#What You\u0026rsquo;ll Learn":"Tables: Data Management in AutoCRUDTables are the foundation of data management in AutoCRUD. They provide a powerful, spreadsheet-like interface for storing, organizing, and working with your data. This section covers everything you need to know about creating and managing tables.\nWhat You’ll Learn How to create and configure tables Ways to customize fields and data types How to work with different view types (Grid, Kanban, etc.) Advanced features like filters, sorting, and formulas Best practices for data organization and management ","working-with-tables#Working with Tables":" Creating tables Modifying table structure Managing relationships Creating views "},"title":"Tables"},"/autocrud-doc/docs/tables/collaboration/":{"data":{"":"Learn how to effectively collaborate with team members on tables in AutoCRUD.","best-practices#Best Practices":"Effective Collaboration Use clear record assignments Maintain organized discussions Keep comments relevant Update status regularly Document important decisions Communication Tips Use @mentions appropriately Keep comments concise Follow up on discussions Archive resolved items Use appropriate channels ","comments-and-discussions#Comments and Discussions":"Adding Comments Click comment icon on records Write and format comments @mention team members Add attachments Thread discussions Comment Features Rich text formatting File attachments User mentions Reply threads Email notifications ","real-time-collaboration#Real-time Collaboration":"Live Updates See changes in real-time Track who’s viewing View edit history Resolve conflicts Sync across devices Activity Tracking View edit history Track changes See user activity Audit logs Change notifications ","record-sharing#Record Sharing":"Share Options Share individual records Share filtered views Set share permissions Generate share links Track shared access Access Levels View only Comment Edit Manage Admin ","security-and-privacy#Security and Privacy":"Access Control Set view permissions Control edit rights Manage sharing Track access Revoke permissions Data Protection Secure sharing Audit trails Version history Data backup Privacy settings ","team-features#Team Features":"Team Management Assign records Track assignments Set due dates Monitor progress Team dashboards Notifications Comment notifications Assignment alerts Due date reminders Change notifications Custom alerts "},"title":"Table Collaboration"},"/autocrud-doc/docs/tables/fields/":{"data":{"":"Learn how to work with different field types and manage columns in your tables.","available-field-types#Available Field Types":"Text Fields Single Line Text: For short text entries Long Text: For longer text content, descriptions Rich Text: Formatted text with styling options Numeric Fields Number: Integer values Decimal: For decimal numbers Currency: Monetary values with currency symbol Special Fields Attachment: Upload and manage files Date/Time: Date and time values Single Select: Choose from predefined options Multi-Select: Multiple choice selection Checkbox: True/false values URL: Web links Email: Email addresses ","best-practices#Best Practices":" Choose appropriate field types Use clear field names Add field descriptions Set proper validation rules Configure default values when needed Organize fields logically ","field-operations#Field Operations":"Adding Fields Click the “+” button in the field header Choose field type from the dropdown Configure field settings: Field name Required/Optional Default value Validation rules Field Configuration Set field as required Add field description Configure field permissions Set default values Add validation rules Column Management Resize columns by dragging edges Reorder columns via drag and drop Hide/Show columns Freeze columns Sort by column Filter by column values ","field-properties#Field Properties":"Common Properties Field name Field type Description Required/Optional Unique values Default value Advanced Properties Custom validation Reference fields Lookup fields Formula fields Rollup fields ","tips-and-tricks#Tips and Tricks":" Use reference fields to link tables Leverage formula fields for calculations Set up rollup fields for aggregations Use lookup fields to display related data Configure field permissions for security "},"title":"Fields"},"/autocrud-doc/docs/tables/filters-sorting/":{"data":{"":"Learn how to organize and find your data using AutoCRUD’s powerful filtering and sorting capabilities.","best-practices#Best Practices":"Filtering Start with broad filters Add specific conditions as needed Use appropriate filter types Save common filters Document filter logic Sorting Choose meaningful sort fields Consider data relationships Use multiple columns when needed Save useful sort combinations Clear sorts when done ","filtering#Filtering":"Basic Filtering Click the filter icon in the toolbar Select field to filter Choose filter condition Enter filter value Apply filter Filter Conditions Available conditions depend on field type:\nText Fields Contains Does not contain Equals Does not equal Starts with Ends with Is empty Is not empty Number Fields Equals Does not equal Greater than Less than Greater than or equal Less than or equal Is empty Is not empty Date Fields Is Is not Before After On or before On or after Is empty Is not empty Advanced Filtering Combine multiple filters Use AND/OR conditions Group filter conditions Save filter presets Share filtered views ","search#Search":"Global Search Quick search across all fields Real-time results Highlight matches Navigate results Column Search Search within specific columns Use column filters Combine with global search Save search criteria ","sorting#Sorting":"Basic Sorting Click column header to sort Click again to reverse order Hold Shift to sort by multiple columns Sort Options Ascending order Descending order Custom sort order Clear sorting Save sort preferences Multiple Column Sorting Sort by primary column Hold Shift and click secondary column Continue for additional columns Adjust sort priority ","tips-and-tricks#Tips and Tricks":" Use filters for data analysis Combine filters and sorts Save view configurations Share filtered views Export filtered data "},"title":"Filters \u0026 Sorting"},"/autocrud-doc/docs/tables/overview/":{"data":{"best-practices#Best Practices":"Naming Conventions Use clear, descriptive names for tables and fields Be consistent with naming patterns Consider including a prefix for related tables Avoid special characters in names Field Organization Group related fields together Order fields logically (e.g., basic info first, details later) Use field descriptions to provide context Consider what fields should be required vs. optional Data Integrity Use appropriate field types for your data Set up validations to ensure data quality Use select fields for consistent categorical data Consider relationships between tables ","creating-and-managing-tables#Creating and Managing Tables":"Creating and Managing TablesTables are the fundamental building blocks for storing and organizing your data in AutoCRUD. This guide walks you through creating, configuring, and managing tables effectively.","creating-your-first-table#Creating Your First Table":"Step 1: Access the Tables Section Navigate to your workspace Click on the Tables icon in the left sidebar Click the + New Table button in the top-right corner Step 2: Define Basic Table Information In the table creation dialog:\nEnter a Table Name (use a clear, descriptive name) Optionally add a Description to help others understand the table’s purpose Select a Table Icon (optional) Click Create Table Step 3: Define Fields (Columns) After creating your table, you’ll be prompted to add fields:\nClick + Add Field to add your first field Enter a Field Name Select the appropriate Field Type (Text, Number, Date, etc.) Configure field-specific options Click Save to add the field Repeat for additional fields Available Field Types AutoCRUD offers a wide range of field types to match your data needs:\nField Type Description Use Cases Single Line Text Short text content Names, titles, short descriptions Long Text Extended text content Descriptions, notes, comments Number Numeric values Quantities, measurements, scores Decimal Precise decimal values Prices, percentages, measurements Date Date values Due dates, start dates, birthdays Date \u0026 Time Date and time values Scheduled events, timestamps Checkbox Boolean (true/false) values Status flags, completion markers Single Select Choose one option from a list Categories, statuses, priorities Multiple Select Choose multiple options Tags, features, attributes User References to workspace users Assignments, responsibilities Attachment Files and media Documents, images, files Link References to other records Relationships between records Formula Calculated values Totals, averages, conditional logic Lookup Display values from linked records Showing related information Rollup Aggregate values from linked records Sums, counts, averages of related records Step 4: Add Records (Rows) Once your fields are set up, you can add data to your table:\nClick the + Add Record button at the bottom of the table Enter values for each field Press Enter or click outside the record to save Continue adding records as needed ","importing-data#Importing Data":"To import existing data into a new or existing table:\nOpen the table or create a new one Click the Import button in the toolbar Select your data source: CSV file Excel spreadsheet JSON file Other database Upload your file or connect to the data source Map imported columns to table fields Review and confirm the import Click Import Data ","managing-existing-tables#Managing Existing Tables":"Renaming a Table Open the table you want to rename Click on the table name at the top of the page Enter the new name Press Enter to save Adding or Modifying Fields To add new fields to an existing table:\nOpen the table Click the + button in the column header area Define the new field as described above To modify an existing field:\nClick on the field name in the column header Select Field Settings or Edit Field Make your changes Click Save Deleting a Table When you no longer need a table:\nGo to the Tables list in your workspace Find the table you want to delete Click the “…” (more options) menu Select Delete Table Confirm the deletion Warning: Deleting a table permanently removes all its data. This action cannot be undone. Consider creating a backup before deletion.","next-steps#Next Steps":"Now that you’ve created your table, learn about:\nWorking with Fields Creating and Managing Views Filtering and Sorting Data Setting Up Table Relationships ","table-templates#Table Templates":"AutoCRUD offers templates for common use cases to help you get started quickly:\nWhen creating a new table, click Start from Template Browse available templates by category Select a template that matches your needs Customize the pre-built structure as needed Popular templates include:\nProject Tracker Customer CRM Inventory Management Event Planning Bug Tracker HR Employee Directory ","what-is-a-table#What is a Table?":"In AutoCRUD, a table is a collection of data organized in rows (records) and columns (fields). Tables provide a familiar spreadsheet-like interface while offering the power and flexibility of a database."},"title":"Creating Tables"},"/autocrud-doc/docs/tables/relationships/":{"data":{"advanced-relationship-features#Advanced Relationship Features":"Lookup Fields Lookup fields display information from linked records directly in your table:\nAdd a new field to your table Select Lookup as the field type Choose the link field to use for the lookup Select which field from the linked table to display Configure display options Example: In an Orders table with a link to Customers, add a lookup field to display the Customer’s email or phone number directly in the Orders table.\nRollup Fields Rollup fields perform calculations on linked records:\nAdd a new field to your table Select Rollup as the field type Choose the link field to use for the rollup Select which field from the linked table to aggregate Choose the aggregation function (Sum, Average, Count, etc.) Example: In a Projects table with links to Tasks, add a rollup field to count the total number of tasks or sum their estimated hours.\nFiltering Linked Records When adding links, you can filter which records are available to link:\nClick in a link field Use the filter option in the record selector Set conditions to narrow down the available records Select from the filtered list ","best-practices-for-table-relationships#Best Practices for Table Relationships":"Data Model Planning Plan your data model before creating complex relationships Diagram your tables and their connections Consider what types of queries you’ll need to perform Think about data integrity and maintenance Naming Conventions Use clear, descriptive names for link fields Name link fields based on the relationship they represent Be consistent with naming patterns across your workspace Consider using prefixes for related fields Performance Considerations Avoid creating unnecessary relationships Be cautious with deeply nested lookups and rollups Consider breaking very complex relationships into simpler ones Use filters to limit the number of linked records when possible ","common-use-cases#Common Use Cases":"Customer Relationship Management (CRM) Customers linked to Orders Contacts linked to Companies Activities linked to Customers Products linked to Orders Project Management Projects linked to Tasks Tasks linked to Team Members Projects linked to Clients Resources linked to Tasks Inventory Management Products linked to Categories Products linked to Suppliers Orders linked to Products Warehouses linked to Inventory Items ","creating-table-relationships#Creating Table Relationships":"Step 1: Add a Link Field Open the table where you want to create the link Click + Add Field Select Link to Another Record as the field type Choose the table you want to link to Configure the relationship settings: Relationship name Field names in both tables Reciprocal field settings Click Save to create the relationship Step 2: Configure Reciprocal Field (Automatic) When you create a link field, AutoCRUD automatically creates a reciprocal field in the linked table:\nFor One-to-Many: Creates a “Many” field in the linked table For Many-to-Many: Creates another “Many” field in the linked table For One-to-One: Creates a “One” field in the linked table You can rename these reciprocal fields to better describe the relationship.","next-steps#Next Steps":"Now that you understand table relationships, learn about:\nBuilding Automated Workflows with Tables ","table-relationships#Table Relationships":"Table RelationshipsOne of the most powerful features of AutoCRUD is the ability to create relationships between tables. This allows you to connect related data and build complex data models similar to relational databases.","troubleshooting-relationships#Troubleshooting Relationships":"Common Issues Issue: Cannot see reciprocal field Solution: Check if the field was renamed or hidden; unhide the field in the field settings\nIssue: Lookup or rollup field not updating Solution: Refresh the view or check if the relationship is set up correctly\nIssue: Difficulty selecting the right records to link Solution: Use filters or improve naming conventions for clearer identification","types-of-relationships#Types of Relationships":"AutoCRUD supports several relationship types:\nOne-to-Many Relationship The most common relationship type, where one record in Table A can be linked to multiple records in Table B.\nExample: A Customer (Table A) can have multiple Orders (Table B).\nMany-to-Many Relationship A relationship where records in both tables can link to multiple records in the other table.\nExample: Students (Table A) can enroll in multiple Courses (Table B), and each Course can have multiple Students.\nOne-to-One Relationship A relationship where one record in Table A corresponds to exactly one record in Table B.\nExample: An Employee (Table A) has one detailed Profile (Table B).","understanding-table-relationships#Understanding Table Relationships":"Table relationships in AutoCRUD allow you to:\nConnect records between different tables View related data in context Maintain data integrity Build sophisticated data models Reduce data duplication ","working-with-linked-records#Working with Linked Records":"Adding Links Between Records To link records together:\nOpen the record you want to link from Click in the link field cell Search for or select the record(s) you want to link to Click outside the cell to save Viewing Linked Records When viewing a record with links:\nThe link field shows the linked records Click on a linked record to expand details Use the “+” icon to add more links Use the “x” icon to remove links Expanding Linked Records To see more details about linked records:\nClick on the linked record Select Expand Record to see full details Navigate between linked records using the arrows "},"title":"Table Relationships"},"/autocrud-doc/docs/tables/views/":{"data":{"advanced-view-techniques#Advanced View Techniques":"Linked Record Views When working with linked records:\nClick on a linked record Open the linked record in a new tab Create specific views for linked record tables Use lookups to display related data in the primary view Conditional Views Create views with dynamic behavior:\nSet up filters based on user or system values Configure conditional formatting rules Use formulas to drive view behavior Set up conditional visibility for fields View Switching Automation Automate view changes based on context:\nCreate links that open specific views Set up default views for different user roles Configure view redirects based on record state Use URL parameters to control view selection ","available-view-types#Available View Types":"Grid View The most common view type, resembling a spreadsheet:\nRows represent records Columns represent fields Inline editing capabilities Sorting and filtering options Resizable and reorderable columns Best for: General data management, data entry, comprehensive overviews\nKanban View A board-style view that organizes records into columns based on a single select or status field:\nVisual organization of records Drag-and-drop functionality Customizable card appearance Color-coding by values Progress visualization Best for: Project management, status tracking, workflow visualization\nForm View A data entry-focused view that presents one record at a time in a form layout:\nClean interface for data entry Field grouping and organization Required field validation Conditional field visibility Mobile-friendly design Best for: Data collection, surveys, structured data entry\nCalendar View Displays records with date fields in a calendar format:\nDay, week, month views Color-coding by field values Duration visualization Click-to-create functionality Event-style interactions Best for: Scheduling, event planning, timeline visualization\nGallery View Presents records as cards in a grid layout with emphasis on visual elements:\nImage-focused presentation Customizable card layout Thumbnail previews Quick record browsing Visual filtering options Best for: Media collections, product catalogs, visual data","creating-and-managing-views#Creating and Managing Views":"Creating a New View Open your table Click the “+” icon next to the view tabs Select the view type you want to create Enter a name for the view Configure view-specific settings Click “Create View” Customizing View Settings Each view type has specific settings you can configure:\nGrid View Settings Column width and order Frozen columns Row height Cell wrapping Conditional formatting Kanban View Settings Grouping field selection Card content customization Column order and visibility Card size and layout Collapsed/expanded states Form View Settings Field order and grouping Field size and layout Section headers Required fields Help text View-Specific Features Grid View Features Column Configuration:\nClick on the column header Use the dropdown menu to access options Resize columns by dragging the column dividers Reorder columns by dragging the column headers Row Actions:\nHover over a row to see action buttons Use context menu (right-click) for additional options Select multiple rows for bulk actions Kanban View Features Column Management:\nAdd new columns through the “+” button Reorder columns by dragging column headers Collapse columns using the collapse icon Configure column settings through the column menu Card Customization:\nClick “Customize cards” in the view menu Select which fields to display on cards Configure card size and layout Set up custom card coloring rules Form View Features Layout Customization:\nEnter design mode through the “Customize form” option Drag fields to reposition them Resize fields using handles Add section headers and descriptions Configure field properties ","next-steps#Next Steps":"Now that you understand views, learn about:\nFiltering and Sorting Data Working with Fields Table Relationships Automating with Tables ","sharing-and-collaborating-with-views#Sharing and Collaborating with Views":"Sharing Specific Views Share particular views with team members:\nOpen the view you want to share Click the “Share” button Choose sharing options: Share with specific users Share with entire workspace Create a public link Set permission levels (view only, edit, etc.) Send the invitation or link View Permissions Control what others can do with your views:\nView Only: Users can only see the data Edit Data: Users can edit records but not the view structure Edit View: Users can modify the view configuration Manage: Users have full control over the view Collaborative View Usage Best practices for team collaboration:\nCreate specialized views for different team roles Use consistent naming conventions for views Document the purpose of each view Regularly review and update view configurations Archive unused views to reduce clutter ","table-views-in-autocrud#Table Views in AutoCRUD":"Table Views in AutoCRUDViews provide different ways to visualize and interact with your table data. AutoCRUD offers multiple view types to help you organize, analyze, and work with your information effectively.","troubleshooting-views#Troubleshooting Views":"Common View Issues Issue: View not displaying expected data Solution: Check filters and sorting settings\nIssue: View performance issues Solution: Reduce the number of displayed fields or limit record count\nIssue: Fields missing from view Solution: Check field visibility settings in view configuration\nIssue: Unable to modify view Solution: Verify you have sufficient permissions for the view","understanding-views#Understanding Views":"Views in AutoCRUD allow you to:\nPresent the same data in different formats Create specialized interfaces for different purposes Save filters and sorting configurations Customize field visibility and arrangement Share specific perspectives with team members ","view-templates-and-examples#View Templates and Examples":"AutoCRUD offers several pre-built view templates:\nProject Tracker: Kanban view for task management Customer Database: Grid view with customer information Event Calendar: Calendar view for scheduling Product Catalog: Gallery view for products Data Entry Form: Form view for structured input "},"title":"Table Views"},"/autocrud-doc/docs/variables/":{"data":{"accessing-variables#Accessing Variables":"To access the Variables section:\nNavigate to your workspace Click on the Variables item in the left sidebar ","best-practices#Best Practices":"Organization Use a consistent naming convention Group related variables with common prefixes Document the purpose of each variable Regularly review and clean up unused variables Security Always encrypt sensitive values like API keys and passwords Limit who can access and edit variables Rotate sensitive variables periodically Don’t store extremely sensitive information like private keys Performance Keep the number of variables manageable Use meaningful names to make variables easy to find Consider using structured data (JSON) for related values ","creating-variables#Creating Variables":"To create a new variable:\nNavigate to the Variables section Click the Add Variable button in the top-right corner In the dialog that appears: Enter a unique Key for your variable Enter the Value for your variable Optionally enable encryption for sensitive values Click Create Variable to save Variable Keys When creating variable keys:\nUse descriptive names that clearly indicate the variable’s purpose Avoid spaces and special characters Consider using a consistent naming convention Remember that keys are case-sensitive Examples of good variable keys:\napi_base_url defaultTaxRate companyName email_template_id Variable Values Variable values can be:\nText strings Numbers JSON data (stored as a string) API keys or credentials (preferably encrypted) Encrypting Sensitive Variables For sensitive information such as API keys or passwords:\nWhen creating or editing a variable, check the Encrypt this variable option The value will be stored securely and displayed as asterisks (***) in the interface The variable can still be used in flows, but its actual value will not be visible in the UI ","managing-variables#Managing Variables":"Searching for Variables If you have many variables, you can use the search function:\nEnter your search term in the Search variables… box The list will filter to show only variables that match your search Editing Variables To modify an existing variable:\nFind the variable in the list Click the Edit button in the Actions column Update the value as needed Click Save to apply your changes Deleting Variables To remove a variable you no longer need:\nFind the variable in the list Click the Delete button in the Actions column Confirm the deletion when prompted Warning: Deleting a variable may break flows that use it. Be sure to update any references to the variable before deletion.","next-steps#Next Steps":"Now that you understand variables, learn about:\nConnecting External Resources Building Automated Workflows ","troubleshooting#Troubleshooting":"Issue: Variable not appearing in flows Solution: Verify the variable name and check for case sensitivity\nIssue: Encrypted variable showing asterisks when you need to see the value Solution: You cannot view the original value of encrypted variables; you’ll need to reset it if you’ve lost the original value\nIssue: Variable changes not affecting flows Solution: Some flows may cache variable values; try restarting the flow","understanding-variables#Understanding Variables":"Variables in AutoCRUD consist of two main components:\nKey: A unique identifier for the variable Value: The data stored in the variable Variables are global to your workspace, meaning they can be accessed from any flow or automation within that workspace.","using-variables-in-flows#Using Variables in Flows":"Variables can be referenced in various parts of your flows:\nIn Flow Steps You can use variables in flow steps using the following syntax:\n{{variables.YOUR_VARIABLE_KEY}} For example, to use a variable named api_key in an HTTP request:\nAuthorization: Bearer {{variables.api_key}} In Conditions Variables can be used in conditional logic:\n{{variables.threshold}} \u003e 100 In Data Transformations Variables can be part of data transformations:\n{{data.price * variables.taxRate}} ","variables-in-autocrud#Variables in AutoCRUD":"","what-youll-learn#What You\u0026rsquo;ll Learn":"Variables in AutoCRUDVariables in AutoCRUD allow you to define and manage global values that can be used across your workspace. They provide a central place to store important values that may be used in multiple flows or settings.\nWhat You’ll Learn How to create and manage global variables Ways to use variables in flows and automations Best practices for variable management Security considerations for sensitive variables "},"title":"Variables"},"/autocrud-doc/docs/welcome/":{"data":{"":"","community--support#Community \u0026amp; Support":" AutoCRUD combines powerful workflow automation with intuitive database management to help teams build, connect, and automate their business processes without coding.\nKey Features Workflow Automation: Create powerful workflows with our visual flow builder Database Management: Manage your data with a familiar spreadsheet interface Multiple Views: Grid, Kanban, and Form views for versatile data visualization AI Integration: Leverage AI capabilities for content generation and analysis Extensive Integrations: Connect with Slack, Discord, email services, and more Quick Navigation Feature Description Workspaces Create and manage collaborative environments Tables Build and manage your database with spreadsheet interface Flows Create automated workflows with our visual builder Variables Store and manage global variables across projects Integrations Connect with external services and tools Get Started Ready to begin? Check out our Getting Started Guide or jump directly to learning about Tables or Flows.\nCommunity \u0026 Support Join our community:\nDiscord GitHub Community Forums \u003cimg src=“https://static.scarf.sh/a.png?x-pxid=c12a77cc-855e-4602-8a0f-614b2d0da56a\" style={{margin: ‘0px’}} /\u003e","get-started#Get Started":"","key-features#Key Features":"","quick-navigation#Quick Navigation":""},"title":"Welcome to Autocrud"},"/autocrud-doc/docs/workspaces/":{"data":{"getting-started#Getting Started":"Ready to create your first workspace? Start with our Creating a Workspace guide.","key-features#Key Features":" Centralized Dashboard: Access all your tables, flows, and resources in one place Collaborative Environment: Work together with team members in real-time Customizable Settings: Configure workspace according to your needs Resource Management: Organize all your data and automation assets Access Controls: Set permissions and control who can view or edit ","what-youll-learn#What You\u0026rsquo;ll Learn":"WorkspacesWorkspaces are the foundation of your AutoCRUD experience. They provide collaborative environments where you can organize your tables, flows, and resources.\nWhat You’ll Learn How to create and set up new workspaces Ways to organize your data and workflows How to manage workspace settings and permissions Best practices for workspace organization Collaboration features for team environments ","workspace-structure#Workspace Structure":"Each workspace contains the following components:\nTables: Your database collections with spreadsheet-like interface Flows: Automated workflows connecting your tools and services Variables: Global variables available across your workspace Resources: External resources connected to your workspace Settings: Configuration options for your workspace ","workspaces#Workspaces":""},"title":"Workspaces"},"/autocrud-doc/docs/workspaces/actions/":{"data":{"":"Learn about the various actions and operations you can perform within an AutoCRUD workspace.","administrative-actions#Administrative Actions":"Workspace Settings Update workspace details Manage storage Configure security Set up backups User Management Add/remove users Modify permissions Track activity Manage roles ","automation-actions#Automation Actions":"Workflow Automation Create triggers Set up actions Define conditions Schedule tasks Integration Options Connect with external services Set up webhooks Configure API access Manage authentication ","best-practices#Best Practices":" Regular maintenance checks Security audits Performance optimization Backup verification User access reviews ","database-operations#Database Operations":"Connection Management Add new database connections Modify existing connections Test connection health View connection metrics Data Source Actions Import/Export data Run SQL queries Schedule backups Monitor performance ","maintenance-operations#Maintenance Operations":"Health Monitoring View system status Check performance metrics Monitor resource usage Track error logs Security Actions Audit access logs Review security settings Manage API keys Configure 2FA ","view-management#View Management":"Create Views Grid views Kanban boards Calendar views Gallery views Form views View Operations Filter data Sort records Group information Share views Set permissions "},"title":"Actions on Workspace"},"/autocrud-doc/docs/workspaces/collaboration/":{"data":{"best-practices-for-team-collaboration#Best Practices for Team Collaboration":"Organization Structure Clear Hierarchy: Define a clear permission structure Documentation: Create documentation for team processes Naming Conventions: Use consistent naming for resources Folder Structure: Organize resources in logical folders Communication Guidelines Regular Updates: Keep team members informed about changes Descriptive Comments: Write clear comments that provide context Status Indicators: Use status fields to show progress Change Logs: Maintain logs of significant changes Security Considerations Principle of Least Privilege: Grant only necessary permissions Regular Audits: Review member access periodically Offboarding Process: Remove access when team members leave Sensitive Data: Mark and restrict access to sensitive information ","collaboration-overview#Collaboration Overview":"With AutoCRUD’s collaboration features, you can:\nInvite team members to workspaces Assign different permission levels Work simultaneously on the same tables and flows Track changes and activities Communicate within the platform Share and control access to resources ","communication-tools#Communication Tools":"Comments Leave comments directly in your workspace:\nSelect a record in a table Click on the comments icon Type your comment @mention team members to notify them Reply to existing comments Notifications Stay informed about important changes:\nIn-app notifications: Receive alerts within AutoCRUD Email notifications: Get updates via email @mentions: Get notified when someone mentions you Custom alerts: Set up notifications for specific events ","managing-team-members#Managing Team Members":"Inviting Team Members Navigate to Settings \u003e Members in your workspace Click Invite Members Enter email addresses (separate multiple addresses with commas) Select the appropriate role for each member Add an optional personal message Click Send Invitations New members will receive an email invitation with instructions to join your workspace.\nMember Roles and Permissions AutoCRUD offers several predefined roles with different permission levels:\nRole Tables Flows Settings Members Billing Owner Full access Full access Full access Can manage all members Full access Admin Full access Full access Limited access Can manage non-owners View only Editor Create \u0026 edit Create \u0026 edit No access No access No access Viewer View only View only No access No access No access Creating Custom Roles For more granular control (available on Pro and Enterprise plans):\nGo to Settings \u003e Members \u003e Roles Click Create Custom Role Name your role Configure specific permissions for each component Save the new role Assign it to existing or new members ","next-steps#Next Steps":"Now that you understand how to collaborate with your team, learn about:\nCreating and Managing Tables Building Automated Workflows ","real-time-collaboration#Real-time Collaboration":"Simultaneous Editing Multiple team members can work on the same workspace simultaneously:\nTables: Multiple users can edit different records at the same time Flows: Members can collaborate on workflow design Comments: Discuss changes directly within the interface Change Tracking Keep track of who made which changes:\nView edit history for each record See who created or modified flows Track configuration changes Filter activity by user, date, or action type ","sharing-and-access-control#Sharing and Access Control":"Sharing Individual Resources Share specific tables or flows with team members:\nOpen the table or flow you want to share Click the Share button Set access level (view, edit, manage) Add users or teams Enable/disable specific permissions Save your sharing settings Public Sharing Share resources with people outside your organization:\nOpen the resource you want to share Click Share \u003e Get Link Configure link permissions: Anyone with the link Password-protected Specific email domains Set expiration date (optional) Copy and share the link ","team-collaboration-in-workspaces#Team Collaboration in Workspaces":"Team Collaboration in WorkspacesAutoCRUD provides powerful collaboration features that allow teams to work together seamlessly on tables, flows, and other workspace components. This guide shows you how to collaborate effectively with your team.","troubleshooting-collaboration-issues#Troubleshooting Collaboration Issues":"Common Issues and Solutions Issue: Member can’t access shared resources Solution: Verify their permission level and ensure the resource is shared correctly\nIssue: Conflicting changes to the same record Solution: Use the change history to review and resolve conflicts\nIssue: Too many notifications Solution: Adjust notification settings in your user preferences\nIssue: Accidental deletion or changes Solution: Use the version history to restore previous versions"},"title":"Collaboration"},"/autocrud-doc/docs/workspaces/create/":{"data":{"best-practices#Best Practices":" One Workspace Per Project: Create separate workspaces for distinct projects or departments Clear Structure: Plan your workspace organization before adding many tables or flows Documentation: Add descriptions to help team members understand the workspace purpose Regular Cleanup: Archive or delete unused elements to maintain a clean workspace Permission Management: Regularly review and update member permissions ","creating-a-workspace#Creating a Workspace":"Creating a WorkspaceWorkspaces in AutoCRUD are the foundation for organizing your data and automations. This guide walks you through creating your first workspace.","next-steps#Next Steps":"Now that you’ve created your workspace, learn about:\nManaging Workspace Settings\nBuilding Automated Workflows","prerequisites#Prerequisites":" An AutoCRUD account Basic understanding of what you want to accomplish with your workspace ","step-1-access-the-workspace-creation-screen#Step 1: Access the Workspace Creation Screen":" Log in to your AutoCRUD account On the homepage, click the Create Workspace button Alternatively, you can click the dropdown menu in the top navigation and select “Create Workspace” ","step-2-enter-workspace-details#Step 2: Enter Workspace Details":"In the workspace creation dialog:\nEnter a unique, descriptive Workspace Name Optionally add a Description to help team members understand the workspace purpose Click Create Workspace to confirm Naming Best Practices Choose workspace names that:\nClearly indicate the purpose or project Are concise but descriptive Follow a consistent naming convention Avoid special characters that might cause issues Examples of good workspace names:\nMarketing Campaigns 2023 Customer Support Database Product Development Finance Department ","step-3-configure-your-new-workspace#Step 3: Configure Your New Workspace":"Once your workspace is created, you’ll be directed to the workspace dashboard where you can:\nStart adding tables to store your data Create flows to automate processes Configure workspace settings Invite team members to collaborate ","step-4-customize-workspace-settings-optional#Step 4: Customize Workspace Settings (Optional)":"You can customize various aspects of your workspace:\nNavigate to the Settings section in the left sidebar Configure: Appearance settings Default permissions Integration options Notification preferences Save your changes ","step-5-invite-team-members-optional#Step 5: Invite Team Members (Optional)":"To collaborate with others in your workspace:\nGo to the Settings section Select the Members tab Click Invite Members Enter email addresses and set permission levels Send invitations ","troubleshooting#Troubleshooting":"Common Issues When Creating Workspaces Issue: Workspace name already exists Solution: Choose a different, unique name for your workspace\nIssue: Cannot create additional workspaces Solution: Check your subscription limits or upgrade your plan\nIssue: Workspace creation fails Solution: Try clearing your browser cache or using a different browser","workspace-limitations#Workspace Limitations":"Keep in mind the following limitations for workspaces:\nFeature Free Plan Pro Plan Enterprise Plan Workspaces 1 Unlimited Unlimited Members per workspace 3 10 Unlimited Storage 1GB 10GB 100GB+ Tables per workspace 10 50 Unlimited Flows per workspace 5 20 Unlimited "},"title":"Creating Workspaces"},"/autocrud-doc/docs/workspaces/overview/":{"data":{"":"A workspace in AutoCRUD is your dedicated environment for managing databases, views, and team collaborations. Think of it as your project’s home base where you can:\nOrganize multiple databases and their connections Create and manage different views of your data Control access permissions for team members Monitor workspace activity and usage ","getting-started#Getting Started":"To make the most of your workspace:\nConfigure your workspace settings Connect your first database Invite team members Create your first view For detailed instructions on creating a workspace, see the Create Workspace guide.","key-features#Key Features":"Central Management Single dashboard to manage all your database connections Overview of all active views and collaborators Usage statistics and activity logs Security Role-based access control Secure database credential management Audit trails for all workspace activities Organization Logical grouping of related databases and views Easy navigation between different projects Customizable workspace settings "},"title":"Workspace Overview"},"/autocrud-doc/docs/workspaces/settings/":{"data":{"accessing-workspace-settings#Accessing Workspace Settings":"","advanced-settings#Advanced Settings":"Additional configuration options for advanced users:\nAPI Access Generate and manage API keys Configure API rate limits Set CORS settings for API access Custom Domain (Enterprise) Connect a custom domain to your workspace Configure SSL certificates Set up domain redirects Audit Logs View all actions performed in the workspace Filter logs by user, action type, date range Export logs for compliance purposes ","best-practices#Best Practices":" Regular Reviews: Periodically review workspace settings, especially security settings Documentation: Document any custom configurations for team reference Testing: Test integrations after setting them up Permissions Audit: Regularly review member permissions Backup Configuration: Ensure proper backup settings are configured ","billing--subscription#Billing \u0026amp; Subscription":"Managing Workspace SettingsWorkspace settings allow you to customize your AutoCRUD environment to fit your team’s needs. This guide covers all the configuration options available for your workspaces.\nAccessing Workspace Settings Navigate to your workspace Click on the Settings icon in the left sidebar Select the appropriate settings category General Settings The General settings tab allows you to configure basic workspace information:\nWorkspace Name and Description Name: Change your workspace name Description: Update the description to help team members understand the workspace purpose Timezone: Set the default timezone for the workspace Appearance Theme: Choose between light, dark, or system theme Accent Color: Select a primary color for your workspace interface Logo: Upload a custom logo for your workspace (Pro and Enterprise plans) Notifications Email Notifications: Configure email alerts for various workspace events In-app Notifications: Set preferences for notifications within the application Digests: Enable daily or weekly summary emails Members \u0026 Permissions The Members section allows you to manage who has access to your workspace and what they can do:\nInviting Members Navigate to Settings \u003e Members Click Invite Members Enter email addresses Select role/permission level Add optional message Click Send Invitations User Roles AutoCRUD offers several predefined roles:\nRole Description Capabilities Owner Full control of workspace Can do everything, including deleting workspace Admin Administrative control Can manage settings, members, and content Editor Can create and modify content Can create and edit tables and flows Viewer Read-only access Can only view tables and flows, cannot edit Custom Permissions For more granular control (available on Pro and Enterprise plans):\nNavigate to Settings \u003e Members Click Custom Roles Create a new role or modify existing ones Set specific permissions for tables, flows, variables, etc. Assign custom roles to members Integrations Manage third-party service connections:\nAvailable Integrations Authentication Providers: Google, GitHub, Microsoft, etc. Communication Tools: Slack, Discord, Microsoft Teams Storage Services: AWS S3, Google Cloud Storage, Dropbox Email Providers: SMTP, SendGrid, Mailgun Analytics Tools: Google Analytics, Mixpanel Setting Up Integrations Navigate to Settings \u003e Integrations Select the service you want to connect Follow the authentication process Configure service-specific settings Test the connection Billing \u0026 Subscription Manage your plan and payment details:\nSubscription Information View current plan details Check usage limits and current usage See billing cycle and next payment date Changing Plans Navigate to Settings \u003e Billing Click Change Plan Select the new plan Confirm the change Review prorated charges or credits Payment Methods Add, remove, or update payment methods View payment history Download invoices ","general-settings#General Settings":"","integrations#Integrations":"","managing-workspace-settings#Managing Workspace Settings":"","members--permissions#Members \u0026amp; Permissions":"","next-steps#Next Steps":"Now that you’ve configured your workspace settings, learn about:\nCollaborating with Team Members Creating Tables and Views Building Automated Workflows ","security#Security":"Configure security settings for your workspace:\nAuthentication Settings Password Requirements: Set minimum complexity requirements Two-Factor Authentication: Require 2FA for all workspace members Session Management: Configure timeout settings Login Restrictions: Limit login attempts, IP restrictions Data Protection Encryption: Configure data encryption settings Backup Settings: Set up regular backups Data Retention: Configure how long data is kept Export Controls: Manage who can export data ","troubleshooting-settings-issues#Troubleshooting Settings Issues":"Common Issues Issue: Changes not saving Solution: Refresh the page and try again, ensure you have proper permissions\nIssue: Integration connection failing Solution: Verify credentials, check service status, review network settings\nIssue: Cannot update billing information Solution: Ensure you’re an Owner or have billing admin privileges"},"title":"Workspace Settings"},"/autocrud-doc/showcase/":{"data":{"community-projects#Community Projects":"Have you built something with AutoCRUD? Share it with us!","featured-projects#Featured Projects":"Project 1 Description of the first project and its features.\nProject 2 Description of the second project and its features.","showcase#Showcase":"ShowcaseHere are some examples of projects built with AutoCRUD:"},"title":"Showcase"}}